const LocList = () =>{
    const loc =[
        {
            "code": "R20",
            "id": "가든쿡",
            "Lat": 37.55789721,
            "Lng": 127.0033455,
            "explain": ""
        },
        {
            "code": "R49C",
            "id": "가온누리",
            "Lat": 37.558199,
            "Lng": 126.999369,
            "explain": ""
        },
        {
            "code": "MK",
            "id": "경영관",
            "Lat": 37.55725211,
            "Lng": 127.0028158,
            "explain": ""
        },
        {
            "code": "XA",
            "id": "계산관A",
            "Lat": 37.560443,
            "Lng": 126.999175,
            "explain": ""
        },
        {
            "code": "X",
            "id": "계산관B",
            "Lat": 37.55961996,
            "Lng": 126.9989859,
            "explain": ""
        },
        {
            "code": "W",
            "id": "과학관",
            "Lat": 37.5568557,
            "Lng": 127.0000136,
            "explain": ""
        },
        {
            "code": "R18C",
            "id": "그루터기",
            "Lat": 37.55698903,
            "Lng": 127.0023178,
            "explain": ""
        },
        {
            "code": "F",
            "id": "다향관",
            "Lat": 37.55905774,
            "Lng": 127.0004482,
            "explain": ""
        },
        {
            "code": "G2",
            "id": "대운동장",
            "Lat": 37.55733143,
            "Lng": 127.0008601,
            "explain": ""
        },
        {
            "code": "D7",
            "id": "동대입구역",
            "Lat": 37.55889546,
            "Lng": 127.0049844,
            "explain": ""
        },
        {
            "code": "D5",
            "id": "듀이카 출구",
            "Lat": 37.559871,
            "Lng": 127.000803,
            "explain": ""
        },
        {
            "code": "BM",
            "id": "만해관",
            "Lat": 37.55761614,
            "Lng": 127.0008737,
            "explain": ""
        },
        {
            "code": "A",
            "id": "명진관",
            "Lat": 37.55761614,
            "Lng": 126.999665,
            "explain": ""
        },
        {
            "code": "K",
            "id": "문화관",
            "Lat": 37.55758006,
            "Lng": 127.0031101,
            "explain": ""
        },
        {
            "code": "BB",
            "id": "법학관",
            "Lat": 37.55796212,
            "Lng": 127.0010774,
            "explain": ""
        },
        {
            "code": "N",
            "id": "본관",
            "Lat": 37.55886673,
            "Lng": 126.9995247,
            "explain": ""
        },
        {
            "code": "R76C",
            "id": "블루팟",
            "Lat": 37.559027,
            "Lng": 126.999354,
            "explain": ""
        },
        {
            "code": "M",
            "id": "사회과학관",
            "Lat": 37.55758007,
            "Lng": 127.0027751,
            "explain": ""
        },
        {
            "code": "FF",
            "id": "상록원",
            "Lat": 37.5576666,
            "Lng": 126.9994884,
            "explain": ""
        },
        {
            "code": "I",
            "id": "신공학관",
            "Lat": 37.55773146,
            "Lng": 126.9983974,
            "explain": ""
        },
        {
            "code": "D1",
            "id": "신공학관 출구",
            "Lat": 37.558331,
            "Lng": 126.99766,
            "explain": ""
        },
        {
            "code": "E",
            "id": "원흥관",
            "Lat": 37.55907575,
            "Lng": 126.9987641,
            "explain": ""
        },
        {
            "code": "D8",
            "id": "장충공원 1",
            "Lat": 37.5579296,
            "Lng": 127.004767,
            "explain": ""
        },
        {
            "code": "D9",
            "id": "장충공원 2",
            "Lat": 37.55738544,
            "Lng": 127.0034994,
            "explain": ""
        },
        {
            "code": "Y",
            "id": "정각원",
            "Lat": 37.55698905,
            "Lng": 127.0009959,
            "explain": ""
        },
        {
            "code": "D0",
            "id": "정문",
            "Lat": 37.55660338,
            "Lng": 127.0032232,
            "explain": ""
        },
        {
            "code": "D2",
            "id": "정보문화관 출구 1",
            "Lat": 37.559552,
            "Lng": 126.998305,
            "explain": ""
        },
        {
            "code": "D3",
            "id": "정보문화관 출구 2",
            "Lat": 37.559841,
            "Lng": 126.99805,
            "explain": ""
        },
        {
            "code": "P",
            "id": "정보문화관P",
            "Lat": 37.55960914,
            "Lng": 126.9986871,
            "explain": ""
        },
        {
            "code": "Q",
            "id": "정보문화관Q",
            "Lat": 37.55968843,
            "Lng": 126.9984155,
            "explain": ""
        },
        {
            "code": "S",
            "id": "조소실습장",
            "Lat": 37.55602677,
            "Lng": 127.0018244,
            "explain": ""
        },
        {
            "code": "C",
            "id": "중앙도서관",
            "Lat": 37.55797294,
            "Lng": 126.9990538,
            "explain": ""
        },
        {
            "code": "G",
            "id": "체육관",
            "Lat": 37.55966681,
            "Lng": 127.0003305,
            "explain": ""
        },
        {
            "code": "J",
            "id": "학림관",
            "Lat": 37.56003082,
            "Lng": 126.9997329,
            "explain": ""
        },
        {
            "code": "Z",
            "id": "학생회관",
            "Lat": 37.55927758,
            "Lng": 126.9985287,
            "explain": ""
        },
        {
            "code": "L",
            "id": "학술관",
            "Lat": 37.55770258,
            "Lng": 127.0036941,
            "explain": ""
        },
        {
            "code": "H",
            "id": "혜화관",
            "Lat": 37.55761974,
            "Lng": 127.0017837,
            "explain": ""
        },
        {
            "code": "R19C",
            "id": "혜화관옆카페",
            "Lat": 37.55723411,
            "Lng": 127.0016976,
            "explain": ""
        },
        {
            "code": "D6",
            "id": "혜화문(중문)",
            "Lat": 37.55876577,
            "Lng": 127.0034814,
            "explain": ""
        },
        {
            "code": "T",
            "id": "혜화별관",
            "Lat": 37.55683047,
            "Lng": 127.0013717,
            "explain": ""
        },
        {
            "code": "D4",
            "id": "후문",
            "Lat": 37.560692,
            "Lng": 126.999335,
            "explain": ""
        }
    ];



    return loc;
}

export default LocList;